week_eight/benchmark_result.log
====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  10 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 2)
50.000% <= 0.263 milliseconds (cumulative count 5045)
75.000% <= 0.295 milliseconds (cumulative count 7654)
87.500% <= 0.335 milliseconds (cumulative count 9043)
93.750% <= 0.351 milliseconds (cumulative count 9457)
96.875% <= 0.383 milliseconds (cumulative count 9727)
98.438% <= 0.415 milliseconds (cumulative count 9846)
99.219% <= 0.455 milliseconds (cumulative count 9925)
99.609% <= 0.511 milliseconds (cumulative count 9963)
99.805% <= 0.623 milliseconds (cumulative count 9983)
99.902% <= 0.735 milliseconds (cumulative count 9991)
99.951% <= 0.783 milliseconds (cumulative count 9996)
99.976% <= 0.823 milliseconds (cumulative count 9999)
99.994% <= 0.839 milliseconds (cumulative count 10000)
100.000% <= 0.839 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
8.900% <= 0.207 milliseconds (cumulative count 890)
80.220% <= 0.303 milliseconds (cumulative count 8022)
98.240% <= 0.407 milliseconds (cumulative count 9824)
99.600% <= 0.503 milliseconds (cumulative count 9960)
99.800% <= 0.607 milliseconds (cumulative count 9980)
99.880% <= 0.703 milliseconds (cumulative count 9988)
99.970% <= 0.807 milliseconds (cumulative count 9997)
100.000% <= 0.903 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17211.71 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.144     0.263     0.359     0.447     0.839

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  10 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 3)
50.000% <= 0.263 milliseconds (cumulative count 5103)
75.000% <= 0.295 milliseconds (cumulative count 7674)
87.500% <= 0.327 milliseconds (cumulative count 8763)
93.750% <= 0.351 milliseconds (cumulative count 9457)
96.875% <= 0.383 milliseconds (cumulative count 9711)
98.438% <= 0.423 milliseconds (cumulative count 9845)
99.219% <= 0.503 milliseconds (cumulative count 9923)
99.609% <= 0.575 milliseconds (cumulative count 9962)
99.805% <= 0.655 milliseconds (cumulative count 9982)
99.902% <= 0.759 milliseconds (cumulative count 9991)
99.951% <= 0.911 milliseconds (cumulative count 9996)
99.976% <= 0.991 milliseconds (cumulative count 9998)
99.988% <= 1.023 milliseconds (cumulative count 9999)
99.994% <= 1.055 milliseconds (cumulative count 10000)
100.000% <= 1.055 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
4.950% <= 0.207 milliseconds (cumulative count 495)
80.590% <= 0.303 milliseconds (cumulative count 8059)
97.970% <= 0.407 milliseconds (cumulative count 9797)
99.230% <= 0.503 milliseconds (cumulative count 9923)
99.700% <= 0.607 milliseconds (cumulative count 9970)
99.870% <= 0.703 milliseconds (cumulative count 9987)
99.930% <= 0.807 milliseconds (cumulative count 9993)
99.950% <= 0.903 milliseconds (cumulative count 9995)
99.980% <= 1.007 milliseconds (cumulative count 9998)
100.000% <= 1.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17123.29 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.271     0.144     0.263     0.359     0.479     1.055

====== GET ======
  10000 requests completed in 0.57 seconds
  6 parallel clients
  20 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 2)
50.000% <= 0.263 milliseconds (cumulative count 5230)
75.000% <= 0.295 milliseconds (cumulative count 7922)
87.500% <= 0.327 milliseconds (cumulative count 8926)
93.750% <= 0.343 milliseconds (cumulative count 9455)
96.875% <= 0.367 milliseconds (cumulative count 9705)
98.438% <= 0.399 milliseconds (cumulative count 9853)
99.219% <= 0.447 milliseconds (cumulative count 9928)
99.609% <= 0.495 milliseconds (cumulative count 9964)
99.805% <= 0.559 milliseconds (cumulative count 9982)
99.902% <= 0.615 milliseconds (cumulative count 9991)
99.951% <= 0.671 milliseconds (cumulative count 9997)
99.976% <= 0.687 milliseconds (cumulative count 9998)
99.988% <= 0.703 milliseconds (cumulative count 9999)
99.994% <= 0.727 milliseconds (cumulative count 10000)
100.000% <= 0.727 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
10.640% <= 0.207 milliseconds (cumulative count 1064)
82.450% <= 0.303 milliseconds (cumulative count 8245)
98.760% <= 0.407 milliseconds (cumulative count 9876)
99.670% <= 0.503 milliseconds (cumulative count 9967)
99.900% <= 0.607 milliseconds (cumulative count 9990)
99.990% <= 0.703 milliseconds (cumulative count 9999)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17482.52 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.265     0.136     0.263     0.351     0.423     0.727

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  20 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5173)
75.000% <= 0.295 milliseconds (cumulative count 7690)
87.500% <= 0.327 milliseconds (cumulative count 8810)
93.750% <= 0.343 milliseconds (cumulative count 9387)
96.875% <= 0.375 milliseconds (cumulative count 9726)
98.438% <= 0.407 milliseconds (cumulative count 9863)
99.219% <= 0.431 milliseconds (cumulative count 9922)
99.609% <= 0.463 milliseconds (cumulative count 9964)
99.805% <= 0.527 milliseconds (cumulative count 9981)
99.902% <= 0.599 milliseconds (cumulative count 9991)
99.951% <= 0.639 milliseconds (cumulative count 9996)
99.976% <= 0.679 milliseconds (cumulative count 9998)
99.988% <= 0.687 milliseconds (cumulative count 9999)
99.994% <= 0.727 milliseconds (cumulative count 10000)
100.000% <= 0.727 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
5.130% <= 0.207 milliseconds (cumulative count 513)
81.500% <= 0.303 milliseconds (cumulative count 8150)
98.630% <= 0.407 milliseconds (cumulative count 9863)
99.780% <= 0.503 milliseconds (cumulative count 9978)
99.910% <= 0.607 milliseconds (cumulative count 9991)
99.990% <= 0.703 milliseconds (cumulative count 9999)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17211.71 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.351     0.423     0.727

====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  50 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5125)
75.000% <= 0.295 milliseconds (cumulative count 7748)
87.500% <= 0.327 milliseconds (cumulative count 8812)
93.750% <= 0.351 milliseconds (cumulative count 9480)
96.875% <= 0.383 milliseconds (cumulative count 9728)
98.438% <= 0.415 milliseconds (cumulative count 9845)
99.219% <= 0.463 milliseconds (cumulative count 9924)
99.609% <= 0.519 milliseconds (cumulative count 9961)
99.805% <= 0.599 milliseconds (cumulative count 9982)
99.902% <= 0.655 milliseconds (cumulative count 9991)
99.951% <= 0.703 milliseconds (cumulative count 9996)
99.976% <= 0.719 milliseconds (cumulative count 9998)
99.988% <= 0.727 milliseconds (cumulative count 10000)
100.000% <= 0.727 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
6.710% <= 0.207 milliseconds (cumulative count 671)
81.090% <= 0.303 milliseconds (cumulative count 8109)
98.210% <= 0.407 milliseconds (cumulative count 9821)
99.550% <= 0.503 milliseconds (cumulative count 9955)
99.830% <= 0.607 milliseconds (cumulative count 9983)
99.960% <= 0.703 milliseconds (cumulative count 9996)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17152.66 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.359     0.447     0.727

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  50 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5229)
75.000% <= 0.295 milliseconds (cumulative count 7800)
87.500% <= 0.327 milliseconds (cumulative count 8785)
93.750% <= 0.343 milliseconds (cumulative count 9394)
96.875% <= 0.375 milliseconds (cumulative count 9722)
98.438% <= 0.407 milliseconds (cumulative count 9847)
99.219% <= 0.447 milliseconds (cumulative count 9924)
99.609% <= 0.503 milliseconds (cumulative count 9963)
99.805% <= 0.559 milliseconds (cumulative count 9981)
99.902% <= 0.639 milliseconds (cumulative count 9991)
99.951% <= 0.703 milliseconds (cumulative count 9997)
99.976% <= 0.711 milliseconds (cumulative count 9998)
99.988% <= 0.719 milliseconds (cumulative count 9999)
99.994% <= 0.743 milliseconds (cumulative count 10000)
100.000% <= 0.743 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
5.850% <= 0.207 milliseconds (cumulative count 585)
81.880% <= 0.303 milliseconds (cumulative count 8188)
98.470% <= 0.407 milliseconds (cumulative count 9847)
99.630% <= 0.503 milliseconds (cumulative count 9963)
99.860% <= 0.607 milliseconds (cumulative count 9986)
99.970% <= 0.703 milliseconds (cumulative count 9997)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17241.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.144     0.263     0.351     0.431     0.743

====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 2)
50.000% <= 0.263 milliseconds (cumulative count 5192)
75.000% <= 0.295 milliseconds (cumulative count 7746)
87.500% <= 0.327 milliseconds (cumulative count 8804)
93.750% <= 0.351 milliseconds (cumulative count 9485)
96.875% <= 0.375 milliseconds (cumulative count 9693)
98.438% <= 0.415 milliseconds (cumulative count 9866)
99.219% <= 0.447 milliseconds (cumulative count 9928)
99.609% <= 0.495 milliseconds (cumulative count 9963)
99.805% <= 0.551 milliseconds (cumulative count 9982)
99.902% <= 0.599 milliseconds (cumulative count 9991)
99.951% <= 0.687 milliseconds (cumulative count 9997)
99.976% <= 0.719 milliseconds (cumulative count 9998)
99.988% <= 0.727 milliseconds (cumulative count 9999)
99.994% <= 0.759 milliseconds (cumulative count 10000)
100.000% <= 0.759 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
6.770% <= 0.207 milliseconds (cumulative count 677)
81.290% <= 0.303 milliseconds (cumulative count 8129)
98.400% <= 0.407 milliseconds (cumulative count 9840)
99.650% <= 0.503 milliseconds (cumulative count 9965)
99.910% <= 0.607 milliseconds (cumulative count 9991)
99.970% <= 0.703 milliseconds (cumulative count 9997)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17241.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.359     0.431     0.759

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5217)
75.000% <= 0.295 milliseconds (cumulative count 7796)
87.500% <= 0.327 milliseconds (cumulative count 8821)
93.750% <= 0.343 milliseconds (cumulative count 9377)
96.875% <= 0.375 milliseconds (cumulative count 9697)
98.438% <= 0.415 milliseconds (cumulative count 9851)
99.219% <= 0.471 milliseconds (cumulative count 9928)
99.609% <= 0.519 milliseconds (cumulative count 9961)
99.805% <= 0.607 milliseconds (cumulative count 9981)
99.902% <= 0.671 milliseconds (cumulative count 9991)
99.951% <= 0.703 milliseconds (cumulative count 9996)
99.976% <= 0.719 milliseconds (cumulative count 9998)
99.988% <= 0.743 milliseconds (cumulative count 9999)
99.994% <= 0.775 milliseconds (cumulative count 10000)
100.000% <= 0.775 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
6.780% <= 0.207 milliseconds (cumulative count 678)
81.750% <= 0.303 milliseconds (cumulative count 8175)
98.280% <= 0.407 milliseconds (cumulative count 9828)
99.530% <= 0.503 milliseconds (cumulative count 9953)
99.810% <= 0.607 milliseconds (cumulative count 9981)
99.960% <= 0.703 milliseconds (cumulative count 9996)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17241.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.359     0.447     0.775

====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  200 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5115)
75.000% <= 0.295 milliseconds (cumulative count 7715)
87.500% <= 0.327 milliseconds (cumulative count 8826)
93.750% <= 0.343 milliseconds (cumulative count 9434)
96.875% <= 0.367 milliseconds (cumulative count 9717)
98.438% <= 0.399 milliseconds (cumulative count 9866)
99.219% <= 0.423 milliseconds (cumulative count 9924)
99.609% <= 0.479 milliseconds (cumulative count 9963)
99.805% <= 0.575 milliseconds (cumulative count 9981)
99.902% <= 0.695 milliseconds (cumulative count 9993)
99.951% <= 0.735 milliseconds (cumulative count 9996)
99.976% <= 0.775 milliseconds (cumulative count 9998)
99.988% <= 0.815 milliseconds (cumulative count 9999)
99.994% <= 0.855 milliseconds (cumulative count 10000)
100.000% <= 0.855 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
5.540% <= 0.207 milliseconds (cumulative count 554)
81.220% <= 0.303 milliseconds (cumulative count 8122)
98.920% <= 0.407 milliseconds (cumulative count 9892)
99.690% <= 0.503 milliseconds (cumulative count 9969)
99.830% <= 0.607 milliseconds (cumulative count 9983)
99.930% <= 0.703 milliseconds (cumulative count 9993)
99.980% <= 0.807 milliseconds (cumulative count 9998)
100.000% <= 0.903 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17271.16 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.351     0.415     0.855

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  200 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5142)
75.000% <= 0.295 milliseconds (cumulative count 7699)
87.500% <= 0.327 milliseconds (cumulative count 8799)
93.750% <= 0.351 milliseconds (cumulative count 9507)
96.875% <= 0.375 milliseconds (cumulative count 9703)
98.438% <= 0.407 milliseconds (cumulative count 9851)
99.219% <= 0.447 milliseconds (cumulative count 9930)
99.609% <= 0.487 milliseconds (cumulative count 9964)
99.805% <= 0.535 milliseconds (cumulative count 9981)
99.902% <= 0.615 milliseconds (cumulative count 9992)
99.951% <= 0.663 milliseconds (cumulative count 9996)
99.976% <= 0.703 milliseconds (cumulative count 9998)
99.988% <= 0.719 milliseconds (cumulative count 9999)
99.994% <= 0.735 milliseconds (cumulative count 10000)
100.000% <= 0.735 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
5.700% <= 0.207 milliseconds (cumulative count 570)
81.270% <= 0.303 milliseconds (cumulative count 8127)
98.510% <= 0.407 milliseconds (cumulative count 9851)
99.720% <= 0.503 milliseconds (cumulative count 9972)
99.900% <= 0.607 milliseconds (cumulative count 9990)
99.980% <= 0.703 milliseconds (cumulative count 9998)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17241.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.351     0.431     0.735

====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  1000 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5119)
75.000% <= 0.295 milliseconds (cumulative count 7629)
87.500% <= 0.327 milliseconds (cumulative count 8856)
93.750% <= 0.343 milliseconds (cumulative count 9479)
96.875% <= 0.359 milliseconds (cumulative count 9745)
98.438% <= 0.383 milliseconds (cumulative count 9848)
99.219% <= 0.431 milliseconds (cumulative count 9926)
99.609% <= 0.487 milliseconds (cumulative count 9964)
99.805% <= 0.543 milliseconds (cumulative count 9983)
99.902% <= 0.599 milliseconds (cumulative count 9991)
99.951% <= 0.695 milliseconds (cumulative count 9997)
99.976% <= 0.711 milliseconds (cumulative count 9998)
99.988% <= 0.727 milliseconds (cumulative count 9999)
99.994% <= 0.751 milliseconds (cumulative count 10000)
100.000% <= 0.751 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
3.130% <= 0.207 milliseconds (cumulative count 313)
81.540% <= 0.303 milliseconds (cumulative count 8154)
98.970% <= 0.407 milliseconds (cumulative count 9897)
99.710% <= 0.503 milliseconds (cumulative count 9971)
99.910% <= 0.607 milliseconds (cumulative count 9991)
99.970% <= 0.703 milliseconds (cumulative count 9997)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17182.13 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.269     0.136     0.263     0.351     0.415     0.751

====== SET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  1000 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5174)
75.000% <= 0.295 milliseconds (cumulative count 7663)
87.500% <= 0.335 milliseconds (cumulative count 9092)
93.750% <= 0.351 milliseconds (cumulative count 9486)
96.875% <= 0.375 milliseconds (cumulative count 9708)
98.438% <= 0.415 milliseconds (cumulative count 9847)
99.219% <= 0.479 milliseconds (cumulative count 9924)
99.609% <= 0.567 milliseconds (cumulative count 9961)
99.805% <= 0.655 milliseconds (cumulative count 9984)
99.902% <= 0.703 milliseconds (cumulative count 9992)
99.951% <= 0.727 milliseconds (cumulative count 9996)
99.976% <= 0.783 milliseconds (cumulative count 9998)
99.988% <= 0.823 milliseconds (cumulative count 9999)
99.994% <= 0.855 milliseconds (cumulative count 10000)
100.000% <= 0.855 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
5.150% <= 0.207 milliseconds (cumulative count 515)
81.360% <= 0.303 milliseconds (cumulative count 8136)
98.220% <= 0.407 milliseconds (cumulative count 9822)
99.410% <= 0.503 milliseconds (cumulative count 9941)
99.740% <= 0.607 milliseconds (cumulative count 9974)
99.920% <= 0.703 milliseconds (cumulative count 9992)
99.980% <= 0.807 milliseconds (cumulative count 9998)
100.000% <= 0.903 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17152.66 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.270     0.144     0.263     0.359     0.455     0.855

====== GET ======
  10000 requests completed in 0.58 seconds
  6 parallel clients
  5000 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5143)
75.000% <= 0.295 milliseconds (cumulative count 7681)
87.500% <= 0.327 milliseconds (cumulative count 8762)
93.750% <= 0.351 milliseconds (cumulative count 9482)
96.875% <= 0.383 milliseconds (cumulative count 9735)
98.438% <= 0.423 milliseconds (cumulative count 9853)
99.219% <= 0.471 milliseconds (cumulative count 9930)
99.609% <= 0.535 milliseconds (cumulative count 9962)
99.805% <= 0.623 milliseconds (cumulative count 9982)
99.902% <= 0.679 milliseconds (cumulative count 9991)
99.951% <= 0.735 milliseconds (cumulative count 9997)
99.976% <= 0.751 milliseconds (cumulative count 9998)
99.988% <= 0.823 milliseconds (cumulative count 9999)
99.994% <= 0.879 milliseconds (cumulative count 10000)
100.000% <= 0.879 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
4.900% <= 0.207 milliseconds (cumulative count 490)
80.840% <= 0.303 milliseconds (cumulative count 8084)
98.150% <= 0.407 milliseconds (cumulative count 9815)
99.520% <= 0.503 milliseconds (cumulative count 9952)
99.790% <= 0.607 milliseconds (cumulative count 9979)
99.940% <= 0.703 milliseconds (cumulative count 9994)
99.980% <= 0.807 milliseconds (cumulative count 9998)
100.000% <= 0.903 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17094.02 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.270     0.136     0.263     0.359     0.447     0.879

====== SET ======
  10000 requests completed in 0.59 seconds
  6 parallel clients
  5000 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 1)
50.000% <= 0.263 milliseconds (cumulative count 5014)
75.000% <= 0.295 milliseconds (cumulative count 7520)
87.500% <= 0.335 milliseconds (cumulative count 8968)
93.750% <= 0.351 milliseconds (cumulative count 9488)
96.875% <= 0.375 milliseconds (cumulative count 9710)
98.438% <= 0.415 milliseconds (cumulative count 9858)
99.219% <= 0.455 milliseconds (cumulative count 9927)
99.609% <= 0.511 milliseconds (cumulative count 9961)
99.805% <= 0.567 milliseconds (cumulative count 9981)
99.902% <= 0.607 milliseconds (cumulative count 9991)
99.951% <= 0.655 milliseconds (cumulative count 9996)
99.976% <= 0.695 milliseconds (cumulative count 9998)
99.988% <= 0.719 milliseconds (cumulative count 9999)
99.994% <= 0.759 milliseconds (cumulative count 10000)
100.000% <= 0.759 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
3.160% <= 0.207 milliseconds (cumulative count 316)
79.580% <= 0.303 milliseconds (cumulative count 7958)
98.380% <= 0.407 milliseconds (cumulative count 9838)
99.580% <= 0.503 milliseconds (cumulative count 9958)
99.910% <= 0.607 milliseconds (cumulative count 9991)
99.980% <= 0.703 milliseconds (cumulative count 9998)
100.000% <= 0.807 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 17006.80 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.272     0.144     0.263     0.359     0.439     0.759